BalaviDeshna/LPC55S69-Trustzone-PinVault/lpcxpresso55s69_hello_world_s_cm33_core0/source/pin_vault_s.c
/*
 * Copyright 2018 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#if (__ARM_FEATURE_CMSE & 1) == 0
#error "Need ARMv8-M security extensions"
#elif (__ARM_FEATURE_CMSE & 2) == 0
#error "Compile with --cmse"
#endif

#include "fsl_device_registers.h"
#include "fsl_debug_console.h"
#include "arm_cmse.h"
#include "board.h"
#include "veneer_table.h"
#include "tzm_config.h"
#include "tzm_api.h"
#include "app.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/
#define NON_SECURE_START DEMO_CODE_START_NS

/*******************************************************************************
 * Prototypes
 ******************************************************************************/

/*******************************************************************************
 * Code
 ******************************************************************************/
/*!
 * @brief Application-specific implementation of the SystemInitHook() weak function.
 */
void SystemInitHook(void)
{
    /* The TrustZone should be configured as early as possible after RESET.
     * Therefore it is called from SystemInit() during startup. The SystemInitHook() weak function
     * overloading is used for this purpose.
     */
    BOARD_InitTrustZone();
}

/*!
 * @brief Main function
 */
int main(void)
{
    /* Init board hardware. */
    BOARD_InitHardware();

    GPIO_PortInit(GPIO, 1u);
    gpio_pin_config_t led_config = {
            kGPIO_DigitalOutput, // Set direction to Output
            1U                   // Set initial state to High (OFF)
        };
    GPIO_PinInit(GPIO, 1u, 4u, &led_config);
    GPIO_PinInit(GPIO, 1u, 7u, &led_config);
    GPIO_PinInit(GPIO, 1u, 6u, &led_config);

    PRINTF("Hello from secure world!\r\n");
    PRINTF("Entering normal world.\r\n");

    /* Call non-secure application - jump to normal world */
    TZM_JumpToNormalWorld(NON_SECURE_START);

    while (1)
    {
        /* This point should never be reached */
    }
}
